fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Больше28дней</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
&НаКлиенте
Перем АдресОтпусковВХранилище, ГодОтпусков;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    // Проверяем, передан ли адрес из первой формы
    Если Параметры.Свойство("АдресОтпусков") Тогда
        АдресОтпусков = Параметры.АдресОтпусков;

        // Получаем таблицу значений из временного хранилища
        ТаблицаОтпусков = ПолучитьИзВременногоХранилища(АдресОтпусков);

        // Загружаем данные в табличную часть
        Объект.ОтпускаСотрудников.Загрузить(ТаблицаОтпусков);
    КонецЕсли;
    
    ГодОтпуска = Параметры.ГодОтпусков;
   // АнализГрафикаОтпусковНаСервере(ДГ,Объект.ОтпускаСотрудников, ГодОтпуска);
    АнализГрафикаОтпусков(ДГ,Объект.ОтпускаСотрудников, ГодОтпуска);

КонецПроцедуры

&НаСервере
Процедура ЗаписатьПодборВХранилище()

    ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить(), АдресОтпусков);

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПодбор() Экспорт

    ПолучитьОтпускаИзХранилища(АдресОтпусков);
    Модифицированность = Истина;

КонецПроцедуры

&НаСервере
Процедура ПолучитьОтпускаИзХранилища(АдресОтпусковВХранилище)

    Объект.ОтпускаСотрудников.Загрузить(ПолучитьИзВременногоХранилища(АдресОтпусковВХранилище));

КонецПроцедуры

&НаСервереБезКонтекста
Процедура АнализГрафикаОтпусков(ДГ,ТаблицаОтпусков, ГодОтпуска)
	
	ДГ.Очистить();

    ДГ.Обновление = Ложь;
	
	ТЧОтпуска = ТаблицаОтпусков.Выгрузить();
	
	Для Каждого Строка Из ТЧОтпуска Цикл
    
        Точка = ДГ.УстановитьТочку(Строка.Сотрудник);
        СерияОтпуск =  ДГ.УстановитьСерию("Отпуск");
        Значение = ДГ.ПолучитьЗначение(Точка, СерияОтпуск);

        Значение.Данные.Сотрудник = Строка.Сотрудник;
       
       //Если отпуск боллее 28 дней интервал окрасить красным
       Если Строка.Больше28дней = Ложь Тогда
        Интервал = Значение.Добавить();
        Интервал.Текст = "Отпуска"; 
        Интервал.Начало = Строка.ДатаНачала;
        Интервал.Конец = Строка.ДатаОкончания;
       Иначе
       	Интервал = Значение.Добавить();
        Интервал.Текст = "Отпуска"; 
        Интервал.Начало = Строка.ДатаНачала;
        Интервал.Конец = Строка.ДатаОкончания;
        Интервал.Цвет = WebЦвета.Красный;
       КонецЕсли;
       
        ДГ.ОбластьЗаголовка.Текст = "Отпуска Сотрудников"; 
        ДГ.АвтоОпределениеПолногоИнтервала = Ложь; 
        ДГ.УстановитьПолныйИнтервал(НачалоГода(ГодОтпуска), КонецГода(ГодОтпуска)); 
        
    КонецЦикла;
	ДГ.Обновление = Истина;
	КонецПроцедуры
